# Rebar Get Termination Rotation Angle Method

Source: https://www.revitapidocs.com/2026/c3c64e0d-6663-b8c0-6fab-25416e3fd34f.htm

---

| Rebar Get Termination Rotation Angle Method |
| --- |

Gets the termination's (e.g hook, crank) out of plane rotation angle at the specified end.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double GetTerminationRotationAngle(
	int end
)
```

```
Public Function GetTerminationRotationAngle (
	end As Integer
) As Double
```

```
public:
double GetTerminationRotationAngle(
	int end
)
```

```
member GetTerminationRotationAngle :
        end : int -> float
```

#### Parameters

end Int32
:   0 for the start, 1 for the end.

#### Return Value

Double
Returns the termination's (e.g hook, crank) out of plane rotation angle at the specified end. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | end must be 0 or 1\. |

See Also

#### Reference

Rebar Class Autodesk.Revit.DB.Structure Namespace